Repository: sidecuter/gciphers
Catalog: po/*.po
Languages: ru_ru

source: Encoding and decoding text in various ciphers
ru_ru: Шифруем и дешифруем текст используя разные шифры

source: No description
ru_ru: Нет описания

source: Window width
ru_ru: Ширина окна

source: Saved window width in pixels
ru_ru: Сохраненное значение ширины окна в пикселях

source: Window height
ru_ru: Высота окна

source: Saved window height in pixels
ru_ru: Сохраненное значение высоты окна в пикселях

source: Atbash
ru_ru: Атбаш

source: Caesar
ru_ru: Цезарь

source: Polybius
ru_ru: Полибий

source: Trithemium
ru_ru: Тритемий

source: Belazo
ru_ru: Белазо

source: Vigenere
ru_ru: Виженер

source: Vertical
ru_ru: Вертикальный

source: VigenereII
ru_ru: ВиженерII

source: Matrix
ru_ru: Матричный

source: Playfair
ru_ru: Плейфер

source: Scrambler
ru_ru: Скрэмблер

source: Shenon
ru_ru: Шенон

source: Show sidebar
ru_ru: Показать боковую панель

source: Menu
ru_ru: Меню

source: _Preferences
ru_ru: Настройки

source: _Keyboard Shortcuts
ru_ru: Горячие клавиши

source: _About GCiphers
ru_ru: О GCiphers

source: Enter you text
ru_ru: Введите фразу

source: Encrypt
ru_ru: Зашифровать

source: Decrypt
ru_ru: Расшифровать

source: Enter key
ru_ru: Введите ключ

source: Enter rows count
ru_ru: Введите количество строк

source: Enter columns count
ru_ru: Введите количество столбцов

source: Enter n
ru_ru: Введите n

source: Get
ru_ru: Получить

source: Enter first scrambler
ru_ru: Введите первый скрэмблер

source: Enter first key
ru_ru: Введите первый ключ

source: Enter second scrambler
ru_ru: Введите второй скрэмблер

source: Enter second key
ru_ru: Введите второй ключ

source: Enter t0
ru_ru: Введите t0

source: Enter a
ru_ru: Введите a

source: Enter c
ru_ru: Введите c

# shortcut window
source: General
ru_ru: Общее

# shortcut window
source: Show Shortcuts
ru_ru: Показать горячие клавиши

# shortcut window
source: Quit
ru_ru: Закрыть

source: Columns*Rows must be bigger than length of alphabet
ru_ru: Произведение количества строк на столбцов должно превышать длину алфавита

source: No such letter in table
ru_ru: Такого символа нет в таблице

source: Indexes must be bigger than 0
ru_ru: Индексы не могут быть нулевыми

source: Row index is higher than maximum
ru_ru: Индекс строки превышает максимальный

source: Column index bigger than maximum
ru_ru: Индекс столбца превышает максимальный

source: Column index bigger than maximum for last row
ru_ru: Индекс столбца превышает максимальный для последней строки

source: Letters count in text for decryption must be a multiple of two
ru_ru: Количество символов должно быть кратно двум

source: This matrix is not square
ru_ru: Матрица не является квадратной

source: Determinant is zero
ru_ru: Детерминант равен нулю

source: Not a valid phrase
ru_ru: Фраза не корректна

source: Phrase contains wrong encrypted components
ru_ru: Фраза содержит неверно защифрованнные фрагменты

source: End of cycle before end of phrase
ru_ru: Конец цикла перед концом фразы

source: Index bigger than string size
ru_ru: Индекс выходит за пределы алфавита

source: Index can't be negative
ru_ru: Индекс не может быть отрицательным

source: Index not found
ru_ru: Индекс не найден

source: Text field is empty
ru_ru: Фраза отсутствует

source: No such letter from phrase in alphabet
ru_ru: В фразе содержится некорректный символ

source: Key is empty
ru_ru: Ключ отсутствует

source: No such letter from key in alphabet
ru_ru: В ключе содержится некорректный символ

source: Key is not a valid number
ru_ru: Ключ не является корректным числом

source: Number is below zero
ru_ru: Ключ не может быть меньше нуля

source: Number is bigger, than alphabet length
ru_ru: Сдвиг больше, чем размер алфавита

source: n is empty
ru_ru: n не указано

source: n is not a valid number
ru_ru: n не является корректным числом

source: n is below or equal one or greater than 10
ru_ru: n меньше либо равно единице или больше чем 10

source: Matrix not determined
ru_ru: Матрица не указана

source: Phrase should be only consist of numbers
ru_ru: Фраза должна состоять из цифр

source: Key must contain only unique letters
ru_ru: Ключ должен содержать только уникальные значения

source: Rows count is empty
ru_ru: Количество строк не указано

source: Rows count is not a valid number
ru_ru: Количество строк не является корректным числом

source: Rows count is below or equal zero
ru_ru: Количество строк не может быть меньше либо равно нулю

source: Columns count is empty
ru_ru: Количество столбцов не указано

source: Columns count is not a valid number
ru_ru: Количество столбцов не является корректным числом

source: Columns count is below or equal zero
ru_ru: Количество столбцов не может быть меньше либо равно нулю

source: Row in string cannot be bigger than table rows count
ru_ru: Показатель строки не должен быть больше количества строк

source: Column in string cannot be bigger than table columns count
ru_ru: Показатель столбца не должен быть больше количества столбцов

source: First scrambler is empty
ru_ru: Первый скрэмблер пуст

source: First scrambler is not a valid number
ru_ru: Первый скрэмблер не является корректным числом

source: First scrambler can contain only 1 or 0
ru_ru: Первый скрэмблер может содержать только 1 или 0

source: Second scrambler is empty
ru_ru: Второй скрэмблер пуст

source: Second scrambler is not a valid number
ru_ru: Второй скрэмблер не является корректным числом

source: Second scrambler can contain only 1 or 0
ru_ru: Второй скрэмблер может содержать только 1 или 0

source: First key is empty
ru_ru: Первый ключ пуст

source: First key is not a valid number
ru_ru: Первый ключ не является корректным числом

source: First key can contain only 1 or 0
ru_ru: Первый ключ может содержать только 1 или 0

source: Second key is empty
ru_ru: Второй скрэмблер пуст

source: Second key is not a valid number
ru_ru: Второй ключ не является корректным числом

source: Second key can contain only 1 or 0
ru_ru: Второй ключ может содержать только 1 или 0

source: T0 is empty
ru_ru: T0 отсутствует

source: T0 is not a valid number
ru_ru: T0 не является корректным числом

source: T0 is below or equal zero
ru_ru: T0 меньше либо равен нулю

source: T0 is bigger than alphabet length
ru_ru: T0 больше чем размер алфавита

source: A is empty
ru_ru: A отсутствует

source: A is not a valid number
ru_ru: A не является корректным числом

source: A is below or equal zero
ru_ru: A меньше либо равен нулю

source: The remainder of A divided by 4 is not equal to 1
ru_ru: Остаток от деления A на 4 не равен 1

source: C is empty
ru_ru: C отсутствует

source: C is not a valid number
ru_ru: C не является корректным числом

source: C is not odd
ru_ru: C не является нечетным

source: Key length is bigger than 1
ru_ru: Длина ключа превышает один символ
